{
  "Attendance": {
    "Introduction": "This application was designed so students would be able to log attendance through their phones with a QR code. It is a multi-tiered application, with a mobile layer, a web layer a backend layer. The web layer handles most of the logic. For this project, I focused primarily on the backend but also aided with some of the front-end code/design.",
    "Body": "Chungus",
    "Images": [ "attendance.png", "Chungus" ],
    "Team": [
      {
        "id": "1",
        "Name": "Rowan Olive",
        "Role": "Backend developer"
      },
      {
        "id": "2",
        "Name": "Ronan",
        "Role": "Team Lead"
      },
      {
        "id": "3",
        "Name": "Daniel",
        "Role": "Frontend developer"
      },
      {
        "id": "4",
        "Name": "Scott",
        "Role": "Mobile developer"
      }

    ]
  },
  "Mugan": {
    "Introduction": "Mugan Trial is a game based on a rogue-lite experience. The player has to traverse procedurally generated rooms that vary between each level of the dungeon. As the player progresses they will become stronger allowing them to progress quicker and fight tougher enemies.",
    "Body": "Mugan was a great game to experiment and use learned coding practices to create a enjoyable video game. From learning how to procedually generate areas, to also being able to diagnose and fix bugs I learnt a lot on this project. This project primarily taught me about game design but also aided in reinforcing coding fundamentals.",
    "Images": [ "mugan.png", "mugan1.png", "mugan2.png", "mugan3.png" ],
    "Team": [
      {
        "id": "1",
        "Name": "Rowan Olive",
        "Role": "Programmer/Art"
      },
      {
        "id": "2",
        "Name": "Cody Couper",
        "Role": "Team Lead"
      },
      {
        "id": "3",
        "Name": "Kevin Young",
        "Role": "Music designer"
      }
    ]
  },
  "Judge": {
    "Introduction": "This application had a very practical real-world application. It was made to replace an existing system that had many issues. It was designed in a way to be deployable and adjustable with the resources being deployed to cloud platforms. The application allows students to upload code directly. This code will be sent off to a sandboxed client that then runs the code against test cases. If it passes/fails then the client will pass back an automated grade to the student.",
    "Body": "Chungus",
    "Images": [ "mugan.png", "mugan1.png", "mugan2.png", "mugan3.png" ],
    "Team": [
      {
        "id": "1",
        "Name": "Rowan Olive",
        "Role": "Programmer/Cloud designer"
      },
      {
        "id": "2",
        "Name": "Daniel",
        "Role": "Programmer"
      },
      {
        "id": "3",
        "Name": "Brayden Michie",
        "Role": "Team Lead"
      }
    ]
  }
}
